In [1]:
import pandas as pd

salaries_df = pd.read_csv('ds_salaries.csv')
salaries_df.shape

(3755, 11)

In [2]:
salaries_df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [6]:
# find the longest string in the experience_level column to determine the proper data type to use in creating the table

# Returning the longest length
print("Longest length is:\n",salaries_df.experience_level.str.len().max())

Longest length is:
 2

In [7]:
salaries_df.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [8]:
# Returning the longest length
print("Longest length is:\n",salaries_df.employment_type.str.len().max())

Longest length is:
 2

In [10]:
salaries_df.employment_type.unique()

array(['FT', 'CT', 'FL', 'PT'], dtype=object)

In [11]:
# Returning the longest length
print("Longest length is:\n",salaries_df.salary_currency.str.len().max())

Longest length is:
 3

In [12]:
print("Longest length is:\n",salaries_df.employee_residence.str.len().max())

Longest length is:
 2

In [16]:
print("The max is:\n",salaries_df.remote_ratio.max())

The max is:
 100

In [17]:
print("Longest length is:\n",salaries_df.company_location.str.len().max())

Longest length is:
 2

In [19]:
print("Longest length is:\n",salaries_df.company_size.str.len().max())

Longest length is:
 1

In [21]:
salaries_df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

__add the index column as a unique identifier for the table primary key__

In [24]:
salaries_df.reset_index()

,index,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...,...
3750,3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

__export the df to csv__

In [26]:
salaries_df.to_csv('ds_salaries_2.csv')

In [27]:
salaries_df_2 = pd.read_csv('ds_salaries_2.csv')

In [ ]:
salaries_df_2.head

what is the highest salary?

 select MAX(salary) from data_science_salaries;
   max    
----------
 30400000
(1 row)

who makes 30 million?

one person makes 30.4 and 2 seemingly identical or even steven partners each make 11M

In [ ]:
SELECT work_year, job_title, salary, company_size, experience_level, employee_residence                                                                                                      FROM data_science_salaries                                                                                                                                                                                WHERE salary > 9000000;
 work_year |    job_title    |  salary  | company_size | experience_level | employee_residence 
-----------+-----------------+----------+--------------+------------------+--------------------
      2021 | BI Data Analyst | 11000000 | L            | MI               | HU
      2020 | Data Scientist  | 11000000 | L            | MI               | HU
      2021 | Data Scientist  | 30400000 | L            | MI               | CL
(3 rows)

what are the distinct job titles?

In [ ]:
SELECT COUNT ( DISTINCT job_title ) AS "distinct job titles"
FROM data_science_salaries;

__93__

what are the higest 20 salaries by job title?

In [ ]:
             job_title              |    average_salary    
------------------------------------+----------------------
 Head of Machine Learning           | 6000000.000000000000
 Principal Data Architect           | 3000000.000000000000
 Lead Machine Learning Engineer     | 2548666.666666666667
 Lead Data Scientist                |  928485.333333333333
 Data Analytics Lead                |  922500.000000000000
 BI Data Analyst                    |  836644.800000000000
 Head of Data Science               |  703729.444444444444
 Lead Data Analyst                  |  655000.000000000000
 ML Engineer                        |  609997.911764705882
 Product Data Analyst               |  412000.000000000000
 Power BI Developer                 |  400000.000000000000
 Data Science Manager               |  379390.413793103448
 Data Science Tech Lead             |  375000.000000000000
 Big Data Engineer                  |  365909.090909090909
 Applied Machine Learning Scientist |  306233.333333333333
 Applied Data Scientist             |  283200.000000000000
 AI Scientist                       |  275312.500000000000
 Machine Learning Research Engineer |  260750.000000000000
 Business Data Analyst              |  256200.000000000000
 Cloud Data Architect               |  250000.000000000000
(20 rows)

In [ ]:
# find if there are any product manager roles listed

SELECT * 
FROM data_science_salaries
WHERE job_title like '%Product Manager%'
LIMIT 11;

SELECT *
FROM data_science_salaries
WHERE job_title LIKE '%Manager%'
LIMIT 11;



# by avg salary with nore than 1 listing in the data
SELECT job_title, AVG(salary) AS average_salary, COUNT(job_title) AS job_count
FROM data_science_salaries
GROUP BY job_title
HAVING COUNT(job_title) > 1
ORDER BY average_salary DESC
LIMIT 20;

In [ ]:
SELECT job_title, AVG(salary) AS average_salary, COUNT(job_title) AS job_count
FROM data_science_salaries
WHERE job_title LIKE '%Principal%'
GROUP BY job_title
HAVING COUNT(job_title) > 1;


SELECT job_title, AVG(salary) AS average_salary, COUNT(job_title) AS job_count
FROM data_science_salaries
WHERE job_title LIKE '%Data Scientist%'
GROUP BY job_title
HAVING COUNT(job_title) > 1;

25th percentile of data scientist salaries?

In [ ]:
SELECT PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY salary) AS percentile_25
FROM data_science_salaries
WHERE job_title = 'Data Scientist';

In [ ]:
percentile_25 
---------------
        107750

In [ ]:
SELECT PERCENTILE_CONT(0.80) WITHIN GROUP (ORDER BY salary) AS percentile_80
FROM data_science_salaries
WHERE job_title = 'Data Scientist';

In [ ]:
 percentile_80 
---------------
        191475

mean, median, mode

In [ ]:
SELECT AVG(salary) AS mean_salary
FROM data_science_salaries;

In [ ]:
     mean_salary     
---------------------
 190695.571770972037

round that shit off

In [ ]:
SELECT ROUND(AVG(salary)) AS mean_salary
FROM data_science_salaries;

In [ ]:
 mean_salary 
-------------
      190696

In [ ]:
SELECT percentile_cont(0.5) WITHIN GROUP (ORDER BY salary) AS median_salary
FROM data_science_salaries;

In [ ]:
 median_salary 
---------------
        138000

In [ ]:
SELECT salary, COUNT(*) AS frequency
FROM data_science_salaries
GROUP BY salary
HAVING COUNT(*) = (
    SELECT MAX(count) 
    FROM (
        SELECT salary, COUNT(*) AS count
        FROM data_science_salaries
        GROUP BY salary
    ) AS counts
);

In [ ]:
 salary | frequency 
--------+-----------
 100000 |       112

whats the average difference between salary and salary_in_usd?

In [ ]:
SELECT ROUND(AVG(salary - salary_in_usd)) AS average_difference
FROM data_science_salaries;

In [ ]:
 average_difference 
--------------------
              53125

whaaa? aha shoulda been using salary_in_usd the whole time

In [ ]:
SELECT ROUND(AVG(salary_in_usd)) AS mean_salary
FROM data_science_salaries;

In [ ]:
 mean_salary 
-------------
      137570

In [ ]:
SELECT percentile_cont(0.5) WITHIN GROUP (ORDER BY salary_in_usd) AS median_salary
FROM data_science_salaries;

In [ ]:
 median_salary 
---------------
        135000

In [ ]:
SELECT salary_in_usd, COUNT(*) AS frequency
FROM data_science_salaries
GROUP BY salary_in_usd
HAVING COUNT(*) = (
    SELECT MAX(count) 
    FROM (
        SELECT salary_in_usd, COUNT(*) AS count
        FROM data_science_salaries
        GROUP BY salary_in_usd
    ) AS counts
);

In [ ]:
 salary_in_usd | frequency 
---------------+-----------
        100000 |        99

In [ ]:
SELECT 
  company_location, 
  ROUND(PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY salary_in_usd)) AS percentile_80,
  ROUND(PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY salary_in_usd)) AS median
FROM data_science_salaries
GROUP BY company_location
ORDER BY percentile_80 desc
LIMIT 20;

In [ ]:
 company_location |         job_title          | percentile_80 | median | count 
------------------+----------------------------+---------------+--------+-------
 US               | Data Science Manager       |        245100 | 190982 |    52
 US               | ML Engineer                |        234640 | 181500 |    28
 US               | Computer Vision Engineer   |        232000 | 205000 |    12
 US               | Applied Scientist          |        222200 | 191738 |    58
 US               | Machine Learning Scientist |        220000 | 170000 |    21
 US               | Research Scientist         |        210000 | 151800 |    58
 US               | Machine Learning Engineer  |        204500 | 164996 |   219
 US               | Research Engineer          |        203000 | 155000 |    31
 US               | Analytics Engineer         |        200000 | 151000 |    92
 US               | Data Engineer              |        195700 | 145000 |   907
 US               | Data Architect             |        194833 | 160000 |    97
 US               | Data Scientist             |        191475 | 152000 |   674
 CA               | Data Scientist             |        190000 | 120000 |    21
 US               | Data Specialist            |        155220 | 110000 |    14
 US               | Data Analytics Manager     |        155000 | 140000 |    21
 US               | Data Analyst               |        150000 | 110600 |   525
 US               | Data Manager               |        146000 | 120000 |    24
 US               | BI Developer               |        140000 | 130000 |    13
 US               | Data Science Consultant    |        132400 | 122000 |    14
 CA               | Data Analyst               |        130000 |  80000 |    16
(20 rows)

In [ ]:
# top 5 countries with more than a dozen entries 

SELECT 
  company_location, 
  ROUND(PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY salary_in_usd)) AS percentile_80,
  ROUND(PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY salary_in_usd)) AS median,
  COUNT(company_location) as count
FROM data_science_salaries
GROUP BY company_location
HAVING COUNT(company_location) > 12
ORDER BY percentile_80 desc
LIMIT 20;

In [ ]:
 company_location | percentile_80 | median | count 
------------------+---------------+--------+-------
 US               |        195000 | 145000 |  3040
 CA               |        186920 | 120000 |    87
 DE               |        123405 |  72722 |    56
 GB               |        109371 |  79513 |   172
 AU               |        103825 |  72525 |    14
 NL               |         98631 |  73546 |    13
 FR               |         86154 |  58970 |    34
 BR               |         78000 |  42000 |    15
 GR               |         73546 |  50216 |    14
 PT               |         69507 |  52932 |    14
 ES               |         68293 |  47280 |    77
 IN               |         34889 |  18276 |    58
(12 rows)